# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'grep'
brew 'hub'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
